benchmark/results/wrk-uwsjs-multi.log
== uwsjs [multi] GET /hello  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.81ms  846.31us  12.07ms   86.89%
    Req/Sec   178.96k    25.58k  262.56k    80.00%
  Latency Distribution
     50%    1.50ms
     75%    2.02ms
     90%    2.84ms
     99%    5.12ms
  1782414 requests in 10.02s, 248.18MB read
Requests/sec: 177882.02
Transfer/sec:     24.77MB
== uwsjs [multi] GET /hello  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.72ms  659.14us  17.59ms   90.14%
    Req/Sec    92.20k    10.56k  104.98k    86.14%
  Latency Distribution
     50%    2.51ms
     75%    2.80ms
     90%    3.33ms
     99%    5.41ms
  1852338 requests in 10.10s, 257.91MB read
Requests/sec: 183336.41
Transfer/sec:     25.53MB
== uwsjs [multi] GET /hello  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.81ms    0.97ms  27.03ms   93.00%
    Req/Sec    44.81k     6.04k   99.66k    85.07%
  Latency Distribution
     50%    2.58ms
     75%    2.94ms
     90%    3.49ms
     99%    5.79ms
  1792550 requests in 10.10s, 249.59MB read
Requests/sec: 177429.74
Transfer/sec:     24.70MB
== uwsjs [multi] GET /hello  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.61ms  699.86us  13.90ms   89.62%
    Req/Sec    23.78k     6.79k  189.79k    92.26%
  Latency Distribution
     50%    2.44ms
     75%    2.72ms
     90%    3.23ms
     99%    5.52ms
  1896365 requests in 10.10s, 264.04MB read
Requests/sec: 187741.90
Transfer/sec:     26.14MB
== uwsjs [multi] GET /hello/inon  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19ms    1.72ms  50.49ms   96.13%
    Req/Sec   210.49k    24.48k  229.79k    93.00%
  Latency Distribution
     50%    2.03ms
     75%    2.27ms
     90%    3.00ms
     99%    5.24ms
  2094539 requests in 10.01s, 289.64MB read
Requests/sec: 209252.83
Transfer/sec:     28.94MB
== uwsjs [multi] GET /hello/inon  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.37ms  499.32us  13.03ms   93.19%
    Req/Sec   105.72k    11.01k  116.94k    93.07%
  Latency Distribution
     50%    2.25ms
     75%    2.37ms
     90%    2.67ms
     99%    4.71ms
  2124543 requests in 10.10s, 293.79MB read
Requests/sec: 210283.19
Transfer/sec:     29.08MB
== uwsjs [multi] GET /hello/inon  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.47ms    0.90ms  29.31ms   94.94%
    Req/Sec    51.28k     9.99k  212.72k    93.77%
  Latency Distribution
     50%    2.32ms
     75%    2.50ms
     90%    2.78ms
     99%    5.43ms
  2046743 requests in 10.10s, 283.03MB read
Requests/sec: 202606.82
Transfer/sec:     28.02MB
== uwsjs [multi] GET /hello/inon  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.74ms    1.13ms  28.53ms   91.76%
    Req/Sec    23.10k     4.63k   31.55k    75.38%
  Latency Distribution
     50%    2.43ms
     75%    2.77ms
     90%    3.49ms
     99%    7.63ms
  1840445 requests in 10.02s, 254.50MB read
Requests/sec: 183743.56
Transfer/sec:     25.41MB
== uwsjs [multi] GET /db  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.42ms  694.09us  23.36ms   95.53%
    Req/Sec   147.77k    13.98k  162.33k    94.00%
  Latency Distribution
     50%    3.28ms
     75%    3.45ms
     90%    3.73ms
     99%    6.52ms
  1469573 requests in 10.01s, 277.05MB read
Requests/sec: 146878.54
Transfer/sec:     27.69MB
== uwsjs [multi] GET /db  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.63ms  816.01us  26.86ms   95.15%
    Req/Sec    69.50k     6.58k   77.90k    90.10%
  Latency Distribution
     50%    3.49ms
     75%    3.67ms
     90%    3.98ms
     99%    7.14ms
  1396611 requests in 10.10s, 263.29MB read
Requests/sec: 138244.58
Transfer/sec:     26.06MB
== uwsjs [multi] GET /db  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.73ms    1.11ms  32.47ms   93.24%
    Req/Sec    33.92k     4.78k   65.04k    87.56%
  Latency Distribution
     50%    3.50ms
     75%    3.80ms
     90%    4.36ms
     99%    7.64ms
  1357073 requests in 10.10s, 255.84MB read
Requests/sec: 134327.51
Transfer/sec:     25.32MB
== uwsjs [multi] GET /db  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.75ms    0.89ms  20.41ms   92.98%
    Req/Sec    16.68k     2.18k   33.98k    94.15%
  Latency Distribution
     50%    3.56ms
     75%    3.84ms
     90%    4.34ms
     99%    8.00ms
  1334164 requests in 10.10s, 251.52MB read
Requests/sec: 132037.73
Transfer/sec:     24.89MB
== uwsjs [multi] POST /echo  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.61ms    4.09ms  79.92ms   97.19%
    Req/Sec   154.27k    33.57k  186.86k    87.00%
  Latency Distribution
     50%    2.90ms
     75%    3.35ms
     90%    4.14ms
     99%   15.78ms
  1533279 requests in 10.02s, 257.36MB read
Requests/sec: 153081.91
Transfer/sec:     25.69MB
== uwsjs [multi] POST /echo  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.02ms  605.11us  14.08ms   89.29%
    Req/Sec    83.22k     8.11k   97.25k    90.59%
  Latency Distribution
     50%    2.83ms
     75%    3.10ms
     90%    3.63ms
     99%    5.62ms
  1672374 requests in 10.10s, 280.70MB read
Requests/sec: 165511.43
Transfer/sec:     27.78MB
== uwsjs [multi] POST /echo  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.87ms  770.65us  30.03ms   93.02%
    Req/Sec    43.89k     5.32k   90.97k    91.79%
  Latency Distribution
     50%    2.74ms
     75%    2.91ms
     90%    3.23ms
     99%    5.69ms
  1754983 requests in 10.10s, 294.57MB read
Requests/sec: 173734.79
Transfer/sec:     29.16MB
== uwsjs [multi] POST /echo  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.90ms  509.06us  13.28ms   89.71%
    Req/Sec    21.44k     2.55k   44.68k    93.41%
  Latency Distribution
     50%    2.79ms
     75%    2.98ms
     90%    3.31ms
     99%    4.92ms
  1715103 requests in 10.10s, 287.87MB read
Requests/sec: 169821.49
Transfer/sec:     28.50MB
== uwsjs [multi] POST /query  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.04ms  747.74us  22.62ms   92.24%
    Req/Sec   124.69k    14.13k  140.53k    86.00%
  Latency Distribution
     50%    3.83ms
     75%    4.16ms
     90%    4.65ms
     99%    7.03ms
  1239691 requests in 10.01s, 230.54MB read
Requests/sec: 123905.88
Transfer/sec:     23.04MB
== uwsjs [multi] POST /query  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.22ms    1.16ms  32.91ms   95.24%
    Req/Sec    60.04k     6.48k   70.44k    85.64%
  Latency Distribution
     50%    4.00ms
     75%    4.28ms
     90%    4.75ms
     99%    8.29ms
  1206261 requests in 10.10s, 224.32MB read
Requests/sec: 119397.61
Transfer/sec:     22.20MB
== uwsjs [multi] POST /query  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.10ms  611.17us  20.73ms   91.97%
    Req/Sec    30.59k     2.49k   35.84k    91.25%
  Latency Distribution
     50%    3.95ms
     75%    4.21ms
     90%    4.59ms
     99%    6.60ms
  1217696 requests in 10.01s, 226.45MB read
Requests/sec: 121704.31
Transfer/sec:     22.63MB
== uwsjs [multi] POST /query  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.08ms    0.98ms  30.93ms   95.82%
    Req/Sec    15.36k     1.47k   23.66k    92.42%
  Latency Distribution
     50%    3.92ms
     75%    4.15ms
     90%    4.47ms
     99%    7.51ms
  1230234 requests in 10.10s, 228.78MB read
Requests/sec: 121799.69
Transfer/sec:     22.65MB